# Задача 10: 
# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
#  Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были 
#  повернуты вверх одной и той же стороной. Выведите минимальное количество монет, 
#  которые нужно перевернуть.
# 5 -> 1 0 1 1 0
# 2

n = input('Введите кол-во монет')
count = 0
for i in range(n):
  if i == 0:
    continue
  if (i + 1) % 2 != n % 2 and (i + 1) % 2 != (i - 1) % 2:
    count += 1
print(count)


# Задача 12: 
# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), 
# а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел 
# S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
# 4 4 -> 2 2
# 5 6 -> 2 3




# Задача 14: 
# Требуется вывести все целые степени двойки (т.е. числа вида 2k), 
# не превосходящие числа N.
# 10 -> 1 2 4 8
